---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentPattern
source: html/6eaf75b1-fad5-96b9-0bdf-bac21fb9a818.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GridEndSegmentPattern Property

"End Segment Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId GridEndSegmentPattern { get; }
```